; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain delivery)
    (:types
        room item arm bot - object
    )
    (:predicates
        (at-bot ?b - bot ?x - room)
        (at ?i - item ?x - room)
        (door ?x - room ?y - room)
        (free ?a - arm)
        (in-arm ?i - item ?a - arm)
        (in-tray ?i - item ?b - bot)
        (mount ?a - arm ?b - bot)
    )

    (:functions
        (load_limit ?b - bot)
        (current_load ?b - bot)
        (weight ?i - item)
        (cost)
    )

    (:action move
        :parameters (?b - bot ?x - room ?y - room)
        :precondition (and (at-bot ?b ?x)
            (door ?x ?y))
        :effect (and (at-bot ?b ?y)
            (not (at-bot ?b ?x))
            (increase (cost) 3)
        )
    )

    (:action pick
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (at ?i ?x) (at-bot ?b ?x) (free ?a) (mount ?a ?b)
            (<= (+ (current_load ?b) (weight ?i)) (load_limit ?b)))
        :effect (and (in-arm ?i ?a)
            (not (at ?i ?x))
            (not (free ?a))
            (increase (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action drop
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (at-bot ?b ?x)
            (mount ?a ?b))
        :effect (and (free ?a)
            (at ?i ?x)
            (not (in-arm ?i ?a))
            (decrease (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action to-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (mount ?a ?b))
        :effect (and (free ?a)
            (not (in-arm ?i ?a))
            (in-tray ?i ?b)
            (increase (cost) 1)
        )
    )

    (:action from-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-tray ?i ?b)
            (mount ?a ?b)
            (free ?a))
        :effect (and (not (free ?a))
            (in-arm ?i ?a)
            (not (in-tray ?i ?b))
            (increase (cost) 1)
        )
    )
)

; problem
(define (problem delivery-x-2)
   (:domain delivery)
   (:objects rooma roomb roomc - room
             item6 item5 item4 item3 item2 item1 - item
             bot1 bot2 - bot
             left1 right1 left2 right2 - arm)
   (:init (= (weight item6) 1)
          (= (weight item5) 1)
          (= (weight item4) 1)
          (= (weight item3) 1)
          (= (weight item2) 1)
          (= (weight item1) 1)

          (at item6 rooma)
          (at item5 rooma)
          (at item4 rooma)
          (at item3 rooma)
          (at item2 rooma)
          (at item1 rooma)

          (at-bot bot1 rooma)
          (at-bot bot2 rooma)
          (free left1)
          (free right1)
          (free left2)
          (free right2)
          (mount left1 bot1)
          (mount right1 bot1)
          (mount left2 bot2)
          (mount right2 bot2)

          (door rooma roomb)
          (door roomb rooma)
          (door rooma roomc)
          (door roomc rooma)

          (= (current_load bot1) 0)
          (= (load_limit bot1) 4)
          (= (current_load bot2) 0)
          (= (load_limit bot2) 4)
          (= (cost) 0))


   (:goal (and (at item6 roomb)
               (at item5 roomb)
               (at item4 roomb)
               (at item3 roomb)
               (at item2 roomc)
               (at item1 roomc)))

   (:metric minimize (cost))
)

; plan
1. (pick item1 rooma right1 bot1)
   deleted: (at item1 rooma) (free right1)
   added: (in-arm item1 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 0 to 2
   goals met: 0 of 6
2. (move bot1 rooma roomc)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomc)
   changed: (cost) from 2 to 5
   goals met: 0 of 6
3. (pick item2 rooma right2 bot2)
   deleted: (at item2 rooma) (free right2)
   added: (in-arm item2 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 5 to 7
   goals met: 0 of 6
4. (drop item1 roomc right1 bot1)
   deleted: (in-arm item1 right1)
   added: (free right1) (at item1 roomc)
   changed: (current_load bot1) from 1 to 0, (cost) from 7 to 9
   goals met: 1 of 6
5. (move bot1 roomc rooma)
   deleted: (at-bot bot1 roomc)
   added: (at-bot bot1 rooma)
   changed: (cost) from 9 to 12
   goals met: 1 of 6
6. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 12 to 15
   goals met: 1 of 6
7. (pick item3 rooma right1 bot1)
   deleted: (at item3 rooma) (free right1)
   added: (in-arm item3 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 15 to 17
   goals met: 1 of 6
8. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 17 to 20
   goals met: 1 of 6
9. (drop item3 roomb right1 bot1)
   deleted: (in-arm item3 right1)
   added: (free right1) (at item3 roomb)
   changed: (current_load bot1) from 1 to 0, (cost) from 20 to 22
   goals met: 2 of 6
10. (drop item2 roomc right2 bot2)
   deleted: (in-arm item2 right2)
   added: (free right2) (at item2 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 22 to 24
   goals met: 3 of 6
11. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 24 to 27
   goals met: 3 of 6
12. (pick item4 rooma right1 bot1)
   deleted: (at item4 rooma) (free right1)
   added: (in-arm item4 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 27 to 29
   goals met: 3 of 6
13. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 29 to 32
   goals met: 3 of 6
14. (drop item4 roomb right1 bot1)
   deleted: (in-arm item4 right1)
   added: (free right1) (at item4 roomb)
   changed: (current_load bot1) from 1 to 0, (cost) from 32 to 34
   goals met: 4 of 6
15. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 34 to 37
   goals met: 4 of 6
16. (pick item5 rooma right1 bot1)
   deleted: (at item5 rooma) (free right1)
   added: (in-arm item5 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 37 to 39
   goals met: 4 of 6
17. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 39 to 42
   goals met: 4 of 6
18. (drop item5 roomb right1 bot1)
   deleted: (in-arm item5 right1)
   added: (free right1) (at item5 roomb)
   changed: (current_load bot1) from 1 to 0, (cost) from 42 to 44
   goals met: 5 of 6
19. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 44 to 47
   goals met: 5 of 6
20. (pick item6 rooma right1 bot1)
   deleted: (at item6 rooma) (free right1)
   added: (in-arm item6 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 47 to 49
   goals met: 5 of 6
21. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 49 to 52
   goals met: 5 of 6
22. (drop item6 roomb right1 bot1)
   deleted: (in-arm item6 right1)
   added: (free right1) (at item6 roomb)
   changed: (current_load bot1) from 1 to 0, (cost) from 52 to 54
   goals met: 6 of 6
